app/controllers/books_controller.rb

  def show
    @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]

  def create
    books = Book.new(books_params)
    if books.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "練習"], ["body", "練習"], ["created_at", "2021-10-11 12:06:44.254329"], ["updated_at", "2021-10-11 12:06:44.254329"]]

  def edit
    @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]

  def update
    books = Book.find(params[:id])
    books.update (books_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "練習"], ["updated_at", "2021-10-11 12:48:58.888282"], ["id", 29]]